In [3]:
import pandas as pd

In [5]:
series = pd.Series(["BMW", "Toyota", "Honda"])
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [7]:
fruit = ["Apple", "Banana", "Orange"]
index = ["a", "b", "c"]
fruit_name = pd.Series(fruit, index=index)
fruit_name

a     Apple
b    Banana
c    Orange
dtype: object

In [9]:
# Series 1-dimensional data
name = pd.Series(["Rohan", "Jeevan", "Krishna"])
name

0      Rohan
1     Jeevan
2    Krishna
dtype: object

In [11]:
series = pd.Series(["Bmw", "Lamborgini", "RR"])
series

0           Bmw
1    Lamborgini
2            RR
dtype: object

In [13]:
color = pd.Series(["Blue", "Yellow", "Black"])
color

0      Blue
1    Yellow
2     Black
dtype: object

In [15]:
# 2-dimensional series
name = pd.DataFrame({"Car Make":series,"Color":color})
name

     Car Make   Color
0         Bmw    Blue
1  Lamborgini  Yellow
2          RR   Black

In [17]:
fruits = pd.Series(["Apple", "Orange", "Mango"])
fruits

0     Apple
1    Orange
2     Mango
dtype: object

In [19]:
color = pd.Series(["Red", "Yellow", "Green"])
color

0       Red
1    Yellow
2     Green
dtype: object

In [21]:
Fruits_name = pd.DataFrame({"Name":fruits,"Color":color})
Fruits_name

     Name   Color
0   Apple     Red
1  Orange  Yellow
2   Mango   Green

### Importing Data

In [24]:
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [30]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [32]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [36]:
# Exporting dataframe
car_sales.to_csv("testoutput.csv", index = False)

# Describe Data

In [41]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [43]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [49]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [53]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [57]:
car_sales.shape

(10, 5)

In [63]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [67]:
car_prices = pd.Series([3000, 6000, 3200])
car_prices

0    3000
1    6000
2    3200
dtype: int64

In [99]:
print(f"Mean of car prices is: {car_prices.mean()}")
print(f"Sum of car prices is: {car_prices.sum()}")

Mean of car prices is: 4066.6666666666665
Sum of car prices is: 12200

In [103]:
car_sales["Doors"].sum()

40

In [105]:
car_sales["Odometer (KM)"].sum()

786014

In [107]:
len(car_sales)

10

In [111]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)